Revit 2024 API
DocumentPrintedEventArgs Methods
The DocumentPrintedEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFailedViewElementIds
 Returns ElementIds of the views that that failed to print (if any).
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPrintedViewElementIds
 Returns ElementIds of the views that printed successfully.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DocumentPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace